<?php
class LangManager{
    private string $defaultLang = 'fa';
    private string $currentLang;
    private array $translations = [];

    public function __construct(string $lang = 'fa'){
        $this->currentLang = $lang;
        $this->loadTranslations();
    }

    private function loadTranslations(): void{
        $this->translations = [
            'fa' => [
                'open_admin_panel_btn'          => '⚙️ پنل مدیریت',
                'change_lang_welcome_text'      => '✅ همکنون میتوانید از ربات استفاده کنید',
                'admin_welcome_to_menu'         => '• به پنل مدیریت ربات خودتون خوش اومدید',
                'start_message'                 => "👋 سلام ادمین عزیز\nبه ربات خودتون خوش آمدید",
                'btn_admin_1'                   => "➕ ایجاد ارائه",
                'btn_admin_2'                   => "📍 مدیریت ارائه",
                'btn_admin_3'                   => "🧾 ارائه های باز",
                'text_1'                        => "📍 برای ایجاد یک ارائه لطفا ابتدا عنوان خودرا وارد کنید\nبرای مدیریت ارائه باید نام خودرا به خاطر داشته باشید",
                'text_2'                        => "⭕️ متاسفانه ارائه ای با این عنوان وجود دارد\nمیتوانید آن را حذف و مجدد ارائه را بسازید",
                'text_3'                        => "✅ ارائه جدید شما در وضعیت پیش نویس قرار گرفت\n(برای ذخیره سازی ارائه ابتدا آیدی عددی چنلی که میخواهید اسلاید ها در آن نمایش داده بشوند را ارسال کنید)\n\nبدون - ارسال کنید\nمعمولا شناسه عددی کانال ها در تلگرام با -100 شروع میشود",
                'text_4'                        => "⭕️ شناسه یک کانال یک عدد میباشد\nپس انتظار از شما میرود که عدد وارد کنید",
                'text_5'                        => "✅ وضعیت ارائه شما : (آماده جهت ارسال اسلاید ها) تغییر کرد\n\n🏞 حالا باید برای من از اسلاید اول دونه به دونه برام تصاویر را ارسال کنی (دقت داشته باش باید دونه به دونه و از اول به آخر ارسال کنی)",
                'text_6'                        => "¯\_(ツ)_/¯ (تصویری شناسایی نشد، شاید بصورت گروهی ارسال کردید که اشتباه میباشد)",
                'text_7'                        => "✅ اسلاید اول ثبت شد (اسلاید های بعدی خودرا وارد کنید)",
                'text_8'                        => "♦️ خطا در پیداکردن ارائه مورد نظر ",
                'text_9'                        => "✅ اسلاید جدید دریافت شد\n(اسلاید بعدی خودرا برای ما ارسال کنید)\n\n🏞 تعداد اسلاید های فعلی : ",
                'text_10'                       => "📍 پس از اتمام کل اسلاید ها دستور زیر را ارسال کنید تا تغییرات ثبت شود\n/finish",
                'text_11'                       => "📍 برای ثبت یک ارائه باید حتما تعداد اسلاید ها بیش از 2 باشد",
                'text_12'                       => "💔 ربات در کانال وارد شده ادمین نیست لطفا ربات را ادمین کنید\nشناسه عددی کانال تلگرامی :",
                'text_13'                       => "♻️ درحال ذخیره سازی تمامیه اسلاید ها لطفا صبرکنید...",
                'text_14'                       => "🤛 عملیات ذخیره سازی به اتمام رسید (درحال آماده سازی داده ها جهت شروع ارائه)",
                'text_15'                       => "✅ ارائه شما باموفقیت برای کانال مورد نظر ارسال شد\nیادت باشه هنگام ارائه استرس نداشته باشی رفیق من :)",
                'text_16'                       => "ارائه مورد نظر یافت نشد",
                'text_17'                       => "اسلاید بعدی یافت نشد",
                'text_18'                       => "⚠️ آیا مطمئن هستید می‌خواهید این ارائه را حذف کنید؟",
                'text_19'                       => "🔄 ارسال ارائه در کانال‌ها",
                'text_20'                       => "📍 لطفا نام ارائه خودرا بصورت دقیق ارسال کنید (شما باید حتما ادمین ارائه باشید)",
                'text_21'                       => "📍 حالا شناسه عددی کانالی که میخواهید در آن ارائه ارسال شود را وارد کنید\n(برای ارسال در کانال ثبت شده فعلی skip را ارسال کنید)",
                'text_22'                       => "🤛 کانال جدید ثبت و ارائه در کانال جدید ارسال شد",
            ],
            'en' => [
                'open_admin_panel_btn'          => '⚙️ Admin Panel',
                'change_lang_welcome_text'      => '✅ You can use the robot now',
                'admin_welcome_to_menu'         => '• Welcome to your robots admin panel.',
                'start_message'                 => "👋 Hello dear admin\nWelcome to your bot",
                'btn_admin_1'                   => "➕ Create a presentation",
                'btn_admin_2'                   => "📍 Presentation Management",
                'btn_admin_3'                   => "🧾 Open presentations",
                'text_1'                        => "📍 To create a presentation, please enter your title first\nYou must remember your name to manage the presentation",
                'text_2'                        => "⭕️ Unfortunately, a presentation with this title already exists.\nYou can delete it and create a new one.",
                'text_3'                        => "✅ Your new presentation is now in draft status.\n(To save the presentation, first send the numeric ID of the channel where you want the slides to appear)\n\nSend without '-' sign.\nUsually, Telegram channel numeric IDs start with -100.",
                'text_4'                        => "⭕️ A channel ID is a number.\nSo please provide a numeric value.",
                'text_5'                        => "✅ Your presentation status has changed to: (Ready to send slides)\n\n🏞 Now you should send me the slides one by one from the first slide (make sure to send them in order from first to last).",
                'text_6'                        => "¯\\_(ツ)_/¯ (No image detected, maybe you sent them as a group which is incorrect.)",
                'text_7'                        => "✅ First slide has been saved (Please send the next slides).",
                'text_8'                        => "♦️ Error: Could not find the requested presentation.",
                'text_9'                        => "✅ New slide received.\n(Please send your next slide)\n\n🏞 Current number of slides: ",
                'text_10'                       => "📍 After sending all slides, use the command below to save changes:\n/finish",
                'text_11'                       => "📍 To register a presentation, there must be more than 2 slides.",
                'text_12'                       => "💔 The bot is not an admin in the channel. Please make the bot an admin.\nTelegram channel numeric ID:",
                'text_13'                       => "♻️ Saving all slides, please wait...",
                'text_14'                       => "🤛 Saving process completed (Preparing data to start the presentation).",
                'text_15'                       => "✅ Your presentation has been successfully sent to the desired channel.\nRemember, stay calm and don’t stress during the presentation, my friend :)",
                'text_16'                       => "Requested presentation not found.",
                'text_17'                       => "Next slide not found.",
                'text_18'                       => "⚠️ Are you sure you want to delete this presentation?",
                'text_19'                       => "🔄 Send the presentation to channels",
                'text_20'                       => "📍 Please send the exact name of your presentation (you must be the admin of the presentation).",
                'text_21'                       => "📍 Now enter the numeric ID of the channel where you want to send the presentation\n(To send to the current registered channel, send \"skip\")",
                'text_22'                       => "🤛 New channel registered and the presentation has been sent to the new channel",
            ],
            'ar' => [
                'open_admin_panel_btn'          => '⚙️ لوحة الإدارة',
                'change_lang_welcome_text'      => '✅يمكنك الآن استخدام الروبوت.',
                'admin_welcome_to_menu'         => '• مرحبًا بك في لوحة إدارة الروبوت الخاص بك.',
                'start_message'                 => "👋 أهلاً بك عزيزي المدير\nمرحباً بك في بوتك",
                'btn_admin_1'                   => "➕ إنشاء عرض تقديمي",
                'btn_admin_2'                   => "📍 إدارة العروض التقديمية",
                'btn_admin_3'                   => "🧾 العروض التقديمية المفتوحة",
                'text_1'                        => "📍 لإنشاء عرض تقديمي، يُرجى إدخال عنوانك أولاً.\nيجب أن تتذكر اسمك لإدارة العرض التقديمي.",
                'text_2'                        => "⭕️ للأسف، يوجد عرض تقديمي بهذا العنوان.\nيمكنك حذفه وإنشاء عرض جديد.",
                'text_3'                        => "✅ العرض التقديمي الجديد الآن في حالة مسودة.\n(لحفظ العرض، أرسل أولاً الرقم التعريفي للقناة حيث تريد عرض الشرائح)\n\nأرسله بدون '-' .\nعادةً ما تبدأ أرقام القنوات في تيليجرام بـ -100.",
                'text_4'                        => "⭕️ رقم القناة يجب أن يكون رقماً.\nلذا يُرجى إدخال قيمة رقمية.",
                'text_5'                        => "✅ تم تغيير حالة العرض التقديمي إلى: (جاهز لإرسال الشرائح)\n\n🏞 الآن يجب أن ترسل لي الشرائح واحدة تلو الأخرى بدءًا من الشريحة الأولى (تأكد من إرسالها بالترتيب من الأول إلى الأخير).",
                'text_6'                        => "¯\\_(ツ)_/¯ (لم يتم التعرف على أي صورة، ربما أرسلتها كمجموعة وهذا غير صحيح.)",
                'text_7'                        => "✅ تم حفظ الشريحة الأولى (يرجى إرسال الشرائح التالية).",
                'text_8'                        => "♦️ خطأ: لم يتم العثور على العرض المطلوب.",
                'text_9'                        => "✅ تم استلام شريحة جديدة.\n(يرجى إرسال الشريحة التالية)\n\n🏞 عدد الشرائح الحالية: ",
                'text_10'                       => "📍 بعد الانتهاء من إرسال جميع الشرائح، استخدم الأمر التالي لحفظ التغييرات:\n/finish",
                'text_11'                       => "📍 لتسجيل عرض تقديمي، يجب أن يكون عدد الشرائح أكثر من 2.",
                'text_12'                       => "💔 البوت ليس مسؤولاً في القناة. يرجى جعل البوت مسؤولاً.\nرقم القناة في تيليجرام:",
                'text_13'                       => "♻️ جاري حفظ جميع الشرائح، يرجى الانتظار...",
                'text_14'                       => "🤛 تم الانتهاء من عملية الحفظ (جارٍ تحضير البيانات لبدء العرض التقديمي).",
                'text_15'                       => "✅ تم إرسال العرض التقديمي بنجاح إلى القناة المطلوبة.\nتذكر، لا تشعر بالتوتر أثناء العرض يا صديقي :)",
                'text_16'                       => "لم يتم العثور على العرض المطلوب.",
                'text_17'                       => "لم يتم العثور على الشريحة التالية.",
                'text_18'                       => "⚠️ هل أنت متأكد أنك تريد حذف هذا العرض؟",
                'text_19'                       => "🔄 إرسال العرض إلى القنوات",
                'text_20'                       => "📍 يرجى إرسال الاسم الدقيق لعرضك (يجب أن تكون مسؤول العرض).",
                'text_21'                       => "📍 الآن أدخل المعرف الرقمي للقناة التي تريد إرسال العرض فيها\n(للإرسال إلى القناة المسجلة الحالية، أرسل \"skip\")",
                'text_22'                       => "🤛 تم تسجيل قناة جديدة وتم إرسال العرض إلى القناة الجديدة",
            ]
        ];
    }

    public function setLang(string $lang): void{
        $this->currentLang = $lang;
    }

    public function get(string $key): string{
        return $this->translations[$this->currentLang][$key]
            ?? $this->translations[$this->defaultLang][$key]
            ?? "[$key]";
    }
}
